glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_KExx_DFP.pdsc
          <book name="Documents/MKE04P24M48SF0RM.pdf" title="Kinetis KE04 Sub-Family Reference Manual"/>
          <book name="Documents/MKE04P24M48SF0.pdf"   title="Kinetis KE04 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKE04Z64xxx4  ****************************** -->
        <device Dname="MKE04Z128xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKE04Z1284.h" define="MKE04Z128xxx4"/>
          <debug svd="SVD/MKE04Z1284.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE04Zxxx_P128KB.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>

          <book name="Documents/MKE04P24M48SF0RM.pdf" title="Kinetis KE04 Sub-Family Reference Manual"/>
          <book name="Documents/MKE04P24M48SF0.pdf"   title="Kinetis KE04 Sub-Family Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KE06  ****************************** -->
      <subFamily DsubFamily="KE06">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
        <description>
The Kinetis KE06 MCU family delivers a next-generation solution with enhanced ESD/EMC performance for cost-sensitive, high-reliability device applications used in high electrical noise environments.
 - Offers a cost-effective, entry-level 32-bit solution featuring low power and high robustness
 - Provides a pin-compatibility within the Kinetis E series portfolio, as well as pin compatibility with Our 8-bit S08P family
 - Includes a powerful array of analog, communication and timing, and control peripherals with varying flash memory size and pin count
        </description>

        <!-- ******************************  MKE06Z64xxx4  ****************************** -->
        <device Dname="MKE06Z64xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKE06Z4.h" define="MKE06Z64xxx4"/>
          <debug svd="SVD/MKE06Z4.svd"/>
          <memory id="IROM1"                          start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                          start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE06Zxxx_P64KB.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>

          <book name="Documents/MKE06P80M48SF0RM.pdf" title="Kinetis KE06 Sub-Family Reference Manual"/>
          <book name="Documents/MKE06P80M48SF0.pdf"   title="Kinetis KE06 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKE06Z128xxx4  ****************************** -->
        <device Dname="MKE06Z128xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKE06Z4.h" define="MKE06Z128xxx4"/>
          <debug svd="SVD/MKE06Z4.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE06Zxxx_P128KB.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>

          <book name="Documents/MKE06P80M48SF0RM.pdf" title="Kinetis KE06 Sub-Family Reference Manual"/>
          <book name="Documents/MKE06P80M48SF0.pdf"   title="Kinetis KE06 Sub-Family Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KE1xZ  ****************************** -->
      <subFamily DsubFamily="KE1xZ">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
        <description>
KE1xZ families based on ARM Cortex-M0+ core, providing upto 256 KB flash, 32 KB RAM, and the complete set of analog/digital features.
KE1xZ256 extends Kinetis E family to higher performance and broader scalability. Robust TSI provides high level stability and accuracy to customers’ HMI system.
1MSPS ADC and Flextimer are perfect solution for BLDC motor control systems.
        </description>

        <!-- ******************************  MKE14Z128xxx7  ****************************** -->
        <device Dname="MKE14Z128xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/MKE14Z7.h" define="MKE14Z128xxx7"/>
          <debug svd="SVD/MKE14Z7.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00008000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P256_2KB_SEC.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
          <algorithm name="Flash/MKE1x_D32_2KB_SEC.FLM"  start="0x10000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KE1xZP100M72SF0RM.pdf" title="Kinetis KE1xZ Sub-Family Reference Manual"/>
          <book name="Documents/KE1xZP100M72SF0.pdf"   title="Kinetis KE1xZ Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKE14Z256xxx7  ****************************** -->
        <device Dname="MKE14Z256xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/MKE14Z7.h" define="MKE14Z256xxx7"/>
          <debug svd="SVD/MKE14Z7.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00008000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFFE000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P256_2KB_SEC.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
          <algorithm name="Flash/MKE1x_D32_2KB_SEC.FLM"  start="0x10000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>

