glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_KExx_DFP.pdsc
          <book name="Documents/KE1xZP100M72SF0RM.pdf" title="Kinetis KE1xZ Sub-Family Reference Manual"/>
          <book name="Documents/KE1xZP100M72SF0.pdf"   title="Kinetis KE1xZ Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKE15Z128xxx7  ****************************** -->
        <device Dname="MKE15Z128xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/MKE15Z7.h" define="MKE15Z128xxx7"/>
          <debug svd="SVD/MKE15Z7.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00008000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P256_2KB_SEC.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
          <algorithm name="Flash/MKE1x_D32_2KB_SEC.FLM"  start="0x10000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KE1xZP100M72SF0RM.pdf" title="Kinetis KE1xZ Sub-Family Reference Manual"/>
          <book name="Documents/KE1xZP100M72SF0.pdf"   title="Kinetis KE1xZ Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKE15Z256xxx7  ****************************** -->
        <device Dname="MKE15Z256xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/MKE15Z7.h" define="MKE15Z256xxx7"/>
          <debug svd="SVD/MKE15Z7.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00008000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFFE000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P256_2KB_SEC.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
          <algorithm name="Flash/MKE1x_D32_2KB_SEC.FLM"  start="0x10000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KE1xZP100M72SF0RM.pdf" title="Kinetis KE1xZ Sub-Family Reference Manual"/>
          <book name="Documents/KE1xZP100M72SF0.pdf"   title="Kinetis KE1xZ Sub-Family Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KE1xF  ****************************** -->
      <subFamily DsubFamily="KE1xF">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="160000000"/>
        <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <description>
Kinetis KE1xF MCUs are the high end series MCUs in Kinetis E family, providing robust 5V solution with the high performance ARM Cortex-M4 core running at up to 168 MHz.
The Kinetis KE1xF MCU family also integrates CAN 2.0B compliant FlexCAN provides high reliable serial communication interface for industry applications, and rich suite of communication interfaces including LPUARTs, LPI2Cs, LPSPIs, and FlexIO.
        </description>

        <!-- ******************************  MKE14F256xxx16  ****************************** -->
        <device Dname="MKE14F256xxx16">
          <compile header="Device/Include/MKE14F16.h" define="MKE14F256xxx16"/>
          <debug svd="SVD/MKE14F16.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00008000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFFC000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P256_4KB_SEC.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
          <algorithm name="Flash/MKE1x_D32_2KB_SEC.FLM"  start="0x10000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KE1xFP100M168SF0RM.pdf" title="Kinetis KE1xF Sub-Family Reference Manual"/>
          <book name="Documents/KE1xFP100M168SF0.pdf"   title="Kinetis KE1xF Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKE14F512xxx16  ****************************** -->
        <device Dname="MKE14F512xxx16">
          <compile header="Device/Include/MKE14F16.h" define="MKE14F512xxx16"/>
          <debug svd="SVD/MKE14F16.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00010000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFF8000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P512_4KB_SEC.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
          <algorithm name="Flash/MKE1x_D64_2KB_SEC.FLM"  start="0x10000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KE1xFP100M168SF0RM.pdf" title="Kinetis KE1xF Sub-Family Reference Manual"/>
          <book name="Documents/KE1xFP100M168SF0.pdf"   title="Kinetis KE1xF Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKE16F256xxx16  ****************************** -->
        <device Dname="MKE16F256xxx16">
          <compile header="Device/Include/MKE16F16.h" define="MKE16F256xxx16"/>
          <debug svd="SVD/MKE16F16.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00008000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFFC000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P256_4KB_SEC.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
          <algorithm name="Flash/MKE1x_D32_2KB_SEC.FLM"  start="0x10000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KE1xFP100M168SF0RM.pdf" title="Kinetis KE1xF Sub-Family Reference Manual"/>
          <book name="Documents/KE1xFP100M168SF0.pdf"   title="Kinetis KE1xF Sub-Family Data Sheet"/>
        </device>

